{
   "tr": {
      "100": "İstemci, isteğinin bir kısmını gönderdi ve sunucudan devam etmesini bekliyor. (100)",
      "101": "Sunucu, istemcinin isteğini karşılamak için geçiş protokolü kullanıyor. (101)",
      "102": "Sunucu, isteği işlerken bir veya daha fazla uzun süreli işlemi başlattı. (102)",
      "200": "İstek başarılı oldu. (200)",
      "201": "İstek başarılı oldu ve yeni bir kaynak oluşturuldu. (201)",
      "202": "İstek kabul edildi, ancak işlenmedi. (202)",
      "203": "İstek başarılı oldu ancak yanıt, kaynağın kendisinden değil bir kopyasından döndü. (203)",
      "204": "İstek başarılı oldu, ancak yanıtın içeriği yok. (204)",
      "205": "İstek başarılı oldu ve istemci, içeriği sıfırlamalı. (205)",
      "206": "İstek başarılı oldu ve sunucu, istemcinin sadece belirli bir kısmını döndürdü. (206)",
      "207": "İstek başarılı oldu ve sunucu, birden çok durum kodu döndürdü. (207)",
      "208": "İstek başarılı oldu ve sunucu, DAV koleksiyonu içinde birden çok kaynak döndürdü. (208)",
      "226": "İstek başarılı oldu ve sunucu, istemcinin isteğini tamamlamak için bir IM kullanıyor. (226)",
      "300": "İstek, birden çok seçenek sunuyor ve kullanıcı veya istemci bir seçim yapmalı. (300)",
      "301": "İstek, istemcinin otomatik olarak yönlendirileceği başka bir konuma yönlendirildi. (301)",
      "302": "İstek, istemcinin otomatik olarak yönlendirileceği başka bir konuma yönlendirildi. (302)",
      "303": "İstek, istemcinin başka bir konuma yönlendirilmesi gerektiğini belirtir. (303)",
      "304": "İstek, istemcinin önbelleğe alınmış bir sürümünü kullanmasını gerektirir. (304)",
      "305": "İstek, istemcinin bir proxy kullanmasını gerektirir. (305)",
      "306": "Bu durum kodu artık kullanılmıyor. (306)",
      "307": "İstek, istemcinin başka bir konuma yönlendirilmesi gerektiğini belirtir. (307)",
      "308": "İstek, istemcinin başka bir konuma yönlendirilmesi gerektiğini belirtir. (308)",
      "400": "Sunucu, isteği anlamıyor. (400)",
      "401": "Kimlik doğrulama gerekiyor. (401)",
      "402": "Ödeme gerekiyor. (402)",
      "403": "İstek yasaklandı. (403)",
      "404": "Kaynak bulunamadı. (404)",
      "405": "Bu yöntem, belirtilen kaynak üzerinde kullanılamaz. (405)",
      "406": "İstemci, sunucunun desteklemediği bir medya türü istedi. (406)",
      "407": "Kimlik doğrulama gerekiyor. (407)",
      "408": "İstek zaman aşımına uğradı. (408)",
      "409": "İstek, sunucunun mevcut durumu nedeniyle yerine getirilemedi. (409)",
      "410": "Kaynak artık mevcut değil ve artık kullanılamaz. (410)",
      "411": "İstek, içerik uzunluğu belirtilmedi. (411)",
      "412": "Önkoşul başarısız. (412)",
      "413": "İstek, sunucunun işleyebileceğinden daha büyük bir içerik uzunluğuna sahip. (413)",
      "414": "İstek, sunucunun işleyebileceğinden daha büyük bir URI uzunluğuna sahip. (414)",
      "415": "İstek, sunucunun desteklemediği bir medya türü içeriyor. (415)",
      "416": "İstek, sunucunun mevcut olmayan bir aralık istedi. (416)",
      "417": "Beklenti başarısız. (417)",
      "418": "Sunucu, bir kahve makinesi ve bir çaydanlık arasında bir karar veremedi. (418)",
      "421": "İstek, bir veya daha fazla sunucu tarafından işlenemedi. (421)",
      "422": "İstek, sunucunun işleyemediği bir varlık tarafından başarısız oldu. (422)",
      "423": "İstek, bir kilitleme hatası nedeniyle başarısız oldu. (423)",
      "424": "İstek, bir önceki isteğe bağlı olarak başarısız oldu. (424)",
      "425": "Sunucu, istemcinin bir gereksinimi karşılamadığını belirtti. (425)",
      "426": "Sunucu, istemcinin güncellemesini gerektiriyor. (426)",
      "428": "İstek, önkoşul gerektiriyor. (428)",
      "429": "İstek, çok fazla istek nedeniyle reddedildi. (429)",
      "431": "İstek, sunucunun mevcut olmayan bir isteğe yanıt vermesini engelleyen alanları içeriyor. (431)",
      "451": "İstek, yasaklandı. (451)",
      "500": "Sunucu, bir iç hata nedeniyle isteği yerine getiremedi. (500)",
      "501": "Sunucu, isteği yerine getirecek bir işlemi desteklemiyor. (501)",
      "502": "Sunucu, bir ağ geçidi veya proxy olarak hareket ederken geçersiz bir yanıt aldı. (502)",
      "503": "Sunucu, şu anda isteği yerine getiremiyor çünkü aşırı yüklü veya bakımda. (503)",
      "504": "Sunucu, bir ağ geçidi veya proxy olarak hareket ederken zaman aşımına uğradı. (504)",
      "505": "Sunucu, HTTP protokolünün bu sürümünü desteklemiyor. (505)",
      "506": "Sunucu, isteği yerine getirmek için gereken bir değişikliği uygulayamıyor. (506)",
      "507": "Sunucu, isteği yerine getirmek için gereken depolama alanına sahip değil. (507)",
      "508": "Sunucu, isteği yerine getirmek için gereken döngü algılama algoritmasına sahip değil. (508)",
      "510": "Sunucu, isteği yerine getirmek için gereken uzatma gereksinimlerine sahip değil. (510)",
      "511": "Sunucu, kimlik doğrulama gerektiriyor. (511)",
      "unknown": "Beklenmeyen bir hata oluştu. (unknown)",
      "unknownDesc": "Beklenmeyen bir hata oluştu. Lütfen daha sonra tekrar deneyin. (unknownDesc)"
   },
   "en": {
      "100": "The client has sent part of its request and is waiting for the server to continue. (100)",
      "101": "The server is switching protocols according to the client's request. (101)",
      "102": "The server has received and is processing the request, but no response is available yet. (102)",
      "200": "The request was successful. (200)",
      "201": "The request was successful and a new resource was created as a result. (201)",
      "202": "The request was successful, but the server has not yet taken any action. (202)",
      "203": "The request was successful, but the information returned may be from another source. (203)",
      "204": "The request was successful, but no content was returned. (204)",
      "205": "The request was successful, but the client must reset the document view. (205)",
      "206": "The request was successful, but only part of the resource was returned. (206)",
      "207": "The request was successful, but multiple status codes are returned. (207)",
      "208": "The request was successful, but the response is of type DAV. (208)",
      "226": "The request was successful, but the response is of type IM. (226)",
      "300": "The request has multiple responses. (300)",
      "301": "The requested resource has been permanently moved to a new location. (301)",
      "302": "The requested resource has been temporarily moved to a new location. (302)",
      "303": "The response to the request can be found under a different URI. (303)",
      "304": "The requested resource has not been modified. (304)",
      "305": "The requested resource must be accessed through a proxy. (305)",
      "306": "The requested resource is no longer available and cannot be accessed. (306)",
      "307": "The requested resource has been temporarily moved to a new location. (307)",
      "308": "The requested resource has been permanently moved to a new location. (308)",
      "400": "The request could not be understood by the server due to incorrect syntax. (400)",
      "401": "The request requires user authentication. (401)",
      "402": "Payment is required to complete the request. (402)",
      "403": "The server understood the request, but refused to fulfill it. (403)",
      "404": "The requested resource could not be found on the server. (404)",
      "405": "The request method is not supported by the server. (405)",
      "406": "The requested resource is only capable of generating content that is not acceptable according to the Accept headers sent in the request. (406)",
      "407": "The client must authenticate itself with the proxy before requesting the response. (407)",
      "408": "The server timed out waiting for the request. (408)",
      "409": "The request could not be completed due to a conflict with the current state of the resource. (409)",
      "410": "The requested resource is no longer available and will not be available again. (410)",
      "411": "The request did not specify the length of its content, which is required by the requested resource. (411)",
      "412": "The server does not meet one of the preconditions specified by the client. (412)",
      "413": "The request is larger than the server is willing or able to process. (413)",
      "414": "The URI provided was too long for the server to process. (414)",
      "415": "The request entity has a media type that the server or resource does not support. (415)",
      "416": "The requested range cannot be satisfied by the server. (416)",
      "417": "The expectation given in the request header could not be met by the server. (417)",
      "418": "I'm a teapot. (418)",
      "421": "The request was directed at a server that is not able to produce a response. (421)",
      "422": "The request was well-formed but was unable to be followed due to semantic errors. (422)",
      "423": "The resource that is being accessed is locked. (423)",
      "424": "The request failed due to failure of a previous request. (424)",
      "425": "The server is unwilling to risk processing a request that might be replayed. (425)",
      "426": "The server cannot process the request using the current protocol. (426)",
      "428": "The origin server requires the request to be conditional. (428)",
      "429": "The user has sent too many requests in a given amount of time. (429)",
      "431": "The server is unwilling to process the request because either an individual header field, or all the header fields collectively, are too large. (431)",
      "451": "The user requests an illegal resource, such as a web page censored by a government. (451)",
      "500": "The server has encountered a situation it doesn't know how to handle. (500)",
      "501": "The request method is not supported by the server and cannot be handled. (501)",
      "502": "The server received an invalid response from an upstream server. (502)",
      "503": "The server is temporarily unavailable, usually due to high load or maintenance. (503)",
      "504": "The gateway server did not receive a timely response from the upstream server. (504)",
      "505": "The server does not support the HTTP protocol version used in the request. (505)",
      "506": "Transparent content negotiation for the request results in a circular reference. (506)",
      "507": "The server is unable to store the representation needed to complete the request. (507)",
      "508": "The server detected an infinite loop while processing the request. (508)",
      "510": "Further extensions to the request are required for the server to fulfill it. (510)",
      "511": "The client needs to authenticate to gain network access. (511)",
      "unknown": "An unknown error occurred. (unknown)",
      "unknownDesc": "An unexpected error occurred. Please try again later. (unknownDesc)"
   },
   "de": {
      "100": "Der Client hat einen Teil seiner Anfrage gesendet und wartet darauf, dass der Server fortfährt. (100)",
      "101": "Der Server wechselt die Protokolle gemäß der Anfrage des Clients. (101)",
      "102": "Der Server hat die Anfrage des Clients erhalten, aber noch keine Antwort. (102)",
      "200": "Die Anfrage war erfolgreich. (200)",
      "201": "Die Anfrage wurde erfolgreich bearbeitet und ein neuer Ressourcen erstellt. (201)",
      "202": "Die Anfrage wurde erfolgreich bearbeitet, aber es gibt keine Antwort. (202)",
      "203": "Die Antwort wird von einer anderen Quelle als dem Server bereitgestellt. (203)",
      "204": "Die Anfrage wurde erfolgreich bearbeitet, aber es gibt keine Antwort. (204)",
      "205": "Die Anfrage wurde erfolgreich bearbeitet, aber der Client muss die Seite neu laden. (205)",
      "206": "Die Antwort enthält nur einen Teil der angeforderten Ressource. (206)",
      "207": "Die Antwort enthält mehrere Statusinformationen. (207)",
      "208": "Die Anfrage wurde erfolgreich bearbeitet, aber es gibt keine Antwort. (208)",
      "226": "Die Anfrage wurde erfolgreich bearbeitet, aber die Antwort enthält eine Änderung der Ressource. (226)",
      "300": "Die Anfrage hat mehrere mögliche Antworten. (300)",
      "301": "Die angeforderte Ressource wurde dauerhaft an eine andere URL verschoben. (301)",
      "302": "Die angeforderte Ressource wurde vorübergehend an eine andere URL verschoben. (302)",
      "303": "Die Antwort auf die Anfrage kann unter einer anderen URL gefunden werden. (303)",
      "304": "Die angeforderte Ressource wurde nicht geändert. (304)",
      "305": "Der Client muss eine Proxy verwenden, um auf die angeforderte Ressource zuzugreifen. (305)",
      "306": "Der Statuscode wird nicht mehr verwendet. (306)",
      "307": "Die angeforderte Ressource wurde vorübergehend an eine andere URL verschoben. (307)",
      "308": "Die angeforderte Ressource wurde dauerhaft an eine andere URL verschoben. (308)",
      "400": "Die Anfrage konnte nicht verstanden werden. (400)",
      "401": "Der Client muss sich authentifizieren, um auf die angeforderte Ressource zuzugreifen. (401)",
      "402": "Der Client muss bezahlen, um auf die angeforderte Ressource zuzugreifen. (402)",
      "403": "Der Client hat keine Berechtigung, auf die angeforderte Ressource zuzugreifen. (403)",
      "404": "Die angeforderte Ressource wurde nicht gefunden. (404)",
      "405": "Die Anfragemethode ist nicht zulässig. (405)",
      "406": "Die angeforderte Ressource kann nicht gemäß den akzeptablen Medientypen bereitgestellt werden. (406)",
      "407": "Der Client muss sich zuerst an einem Proxy authentifizieren, um auf die angeforderte Ressource zuzugreifen. (407)",
      "408": "Der Client hat zu lange gewartet, um eine Anfrage zu senden. (408)",
      "409": "Ein Konflikt ist aufgetreten und die Anfrage konnte nicht bearbeitet werden. (409)",
      "410": "Die angeforderte Ressource ist nicht mehr verfügbar und wurde dauerhaft gelöscht. (410)",
      "411": "Der Server erwartet, dass der Client die Länge der Anfrage angibt. (411)",
      "412": "Eine der Voraussetzungen, die der Server in der Anfrage des Clients festgelegt hat, wurde nicht erfüllt. (412)",
      "413": "Die Anfrage ist zu groß, um verarbeitet zu werden. (413)",
      "414": "Die URL der Anfrage ist zu lang, um verarbeitet zu werden. (414)",
      "415": "Der Medientyp der Anfrage wird vom Server nicht unterstützt. (415)",
      "416": "Der Bereich der angeforderten Ressource ist nicht zulässig. (416)",
      "417": "Die Erwartung des Servers konnte nicht erfüllt werden. (417)",
      "418": "Ich bin ein Teekessel. (418)",
      "421": "Die angeforderte Ressource kann nicht bereitgestellt werden, da sie die Anforderungen für die Anforderung erfüllt, die vom Server gestellt wurde. (421)",
      "422": "Die Anfrage kann nicht verarbeitet werden, da sie eine oder mehrere ungültige Entitätsdaten enthält. (422)",
      "423": "Die angeforderte Ressource ist gesperrt. (423)",
      "424": "Die Anfrage kann nicht verarbeitet werden, da sie auf eine gesperrte Ressource verweist. (424)",
      "425": "Der Server erfüllt die Anforderungen des Clients nicht, um die Anfrage zu verarbeiten. (425)",
      "426": "Der Client sollte auf TLS aktualisieren, um die Anfrage zu verarbeiten. (426)",
      "428": "Der Server erfüllt die Anforderungen des Clients nicht, um die Anfrage zu verarbeiten. (428)",
      "429": "Der Client hat zu viele Anfragen gesendet. (429)",
      "431": "Der Server erfüllt die Anforderungen des Clients nicht, um die Anfrage zu verarbeiten. (431)",
      "451": "Der Server ist nicht in der Lage, auf die Anfrage zuzugreifen, da sie durch rechtliche Gründe gesperrt ist. (451)",
      "500": "Ein interner Serverfehler ist aufgetreten. (500)",
      "501": "Der Server kann die Anfrage des Clients nicht verarbeiten. (501)",
      "502": "Der Server hat eine ungültige Antwort von einem anderen Server erhalten. (502)",
      "503": "Der Server ist vorübergehend nicht verfügbar. (503)",
      "504": "Der Server hat keine Antwort von einem anderen Server erhalten. (504)",
      "505": "Der Server unterstützt die HTTP-Version nicht. (505)",
      "506": "Der Server kann die Anfrage nicht verarbeiten, da sie eine Schleife enthält. (506)",
      "507": "Der Server kann die Anfrage nicht verarbeiten, da er nicht genügend Speicherplatz hat. (507)",
      "508": "Der Server kann die Anfrage nicht verarbeiten, da er eine Schleife erkannt hat. (508)",
      "510": "Der Server kann die Anfrage nicht verarbeiten, da er eine Erweiterung benötigt. (510)",
      "511": "Der Server kann die Anfrage nicht verarbeiten, da der Client sich zuerst authentifizieren muss. (511)",
      "unknown": "Ein unbekannter Fehler ist aufgetreten. (unknown)",
      "unknownDesc": "Ein unerwarteter Fehler ist aufgetreten. Bitte versuchen Sie es später erneut. (unknownDesc)"
   }
}
